 <b> 3. Import the required packages <b>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

<b> 4. Use the magic command so that your plots show in the notebook without having to call --- every time. <b>

In [2]:
%matplotlib inline

<b>5. Using pandas method, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.<b>

In [3]:
gdp_df = pd.read_csv("../Data/gdp_percapita.csv", nrows=6868)
print(gdp_df[:7])

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN

<b>6. Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.<b>

In [4]:
internet_df = pd.read_csv("../Data/internet_use.csv", nrows=4495)
print(internet_df[:7])

  Country or Area  Year     Value  Value Footnotes  Unnamed: 4  Unnamed: 5
0     Afghanistan  2014  6.390000              NaN         NaN         NaN
1     Afghanistan  2013  5.900000              NaN         NaN         NaN
2     Afghanistan  2012  5.454545              NaN         NaN         NaN
3     Afghanistan  2011  5.000000              NaN         NaN         NaN
4     Afghanistan  2010  4.000000              NaN         NaN         NaN
5     Afghanistan  2009  3.550000              NaN         NaN         NaN
6     Afghanistan  2008  1.840000              NaN         NaN         NaN

<b>7. Look at the shape of each DataFrame - how many rows? How many columns?<b>

FOR gdp_df: (all together dataframe)
ROWS = 6869
COLUMNS = 4

FOR gdp_df: (first 6 dataframe)
ROWS: 10 with values, 11 all together
COLUMNS:4

FOR internet_df: (all together dataframe)
ROWS: 4496
COLUMNS: 6

FOR internet_df: (frist 6 dataframe)
ROWS: 10 with values, 11 all together
COLUMNS: 6

<b> 8.Take a look at the datatypes for the columns in each DataFrame. <b>

In [12]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [13]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
Unnamed: 4         float64
Unnamed: 5         float64
dtype: object


<b>9. Take a look at the last 10 rows of each DataFrame in turn. <b>

In [29]:
print(gdp_df[-10:])

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [33]:
print(internet_df[-10:])

     Country or Area  Year     Value  Value Footnotes  Unnamed: 4  Unnamed: 5
4485        Zimbabwe  2002  3.994356              NaN         NaN         NaN
4486        Zimbabwe  2001  0.799846              NaN         NaN         NaN
4487        Zimbabwe  2000  0.401434              NaN         NaN         NaN
4488        Zimbabwe  1999  0.161676              NaN         NaN         NaN
4489        Zimbabwe  1998  0.081648              NaN         NaN         NaN
4490        Zimbabwe  1997  0.033080              NaN         NaN         NaN
4491        Zimbabwe  1996  0.016790              NaN         NaN         NaN
4492        Zimbabwe  1995  0.007684              NaN         NaN         NaN
4493        Zimbabwe  1994  0.001739              NaN         NaN         NaN
4494        Zimbabwe  1990  0.000000              NaN         NaN         NaN

<b> 10. Drop the value footnotes column from both DataFrames. Check that this worked as expected. <b>

In [44]:
gdp_df.drop(columns=['Value Footnotes'])

     Country or Area  Year        Value
0        Afghanistan  2019  2065.036398
1        Afghanistan  2018  2033.779002
2        Afghanistan  2017  2058.383832
3        Afghanistan  2016  2057.062164
4        Afghanistan  2015  2068.265904
...              ...   ...          ...
6863        Zimbabwe  1994  3263.934978
6864        Zimbabwe  1993  3033.504852
6865        Zimbabwe  1992  3054.889178
6866        Zimbabwe  1991  3426.598094
6867        Zimbabwe  1990  3324.348171

[6868 rows x 3 columns]

In [46]:
internet_df.drop(columns=['Value Footnotes'])

     Country or Area  Year     Value  Unnamed: 4  Unnamed: 5
0        Afghanistan  2014  6.390000         NaN         NaN
1        Afghanistan  2013  5.900000         NaN         NaN
2        Afghanistan  2012  5.454545         NaN         NaN
3        Afghanistan  2011  5.000000         NaN         NaN
4        Afghanistan  2010  4.000000         NaN         NaN
...              ...   ...       ...         ...         ...
4490        Zimbabwe  1997  0.033080         NaN         NaN
4491        Zimbabwe  1996  0.016790         NaN         NaN
4492        Zimbabwe  1995  0.007684         NaN         NaN
4493        Zimbabwe  1994  0.001739         NaN         NaN
4494        Zimbabwe  1990  0.000000         NaN         NaN

[4495 rows x 5 columns]

<b> 10. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’. <b>